//////////////////////////////////////////////////////////////////////////
// 
//			*** lifeEngine (Двигатель Жизни) ***
//					Copyright (C) 2017
//
// Связь со мной:		https://vk.com/zombihello
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// 
//////////////////////////////////////////////////////////////////////////

#ifndef PLANE_H
#define PLANE_H

#define COMPILING_LIBRARY
#include <DllGlobal.h>

//////////////
// OPENGL
//////////////
#include <glew\glew.h>

namespace le
{
	//-------------------------------------------------------------------------//

	struct BSPFace;

	//-------------------------------------------------------------------------//

	struct DLL_API Plane
	{
		int					StartIndex;		///< Начальный индекс в буфере индексов
		int					NumberIndices;	///< Количество индексов в плоскости
		int					Type;			///< Тип плоскости

		GLuint				Texture;		///< Идентификатор текстуры
		GLuint				Lightmap;		///< Идентификатор карты освещения
	};

	//-------------------------------------------------------------------------//
}

#endif // PLANE_H