//////////////////////////////////////////////////////////////////////////
// 
//			*** lifeEngine (Двигатель Жизни) ***
//					Copyright (C) 2017
//
// Связь со мной:		https://vk.com/zombihello
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// 
//////////////////////////////////////////////////////////////////////////

#ifndef PLANE_H
#define PLANE_H

#define COMPILING_LIBRARY
#include <DllGlobal.h>

//////////////
// OPENGL
//////////////
#include <glew\glew.h>

namespace le
{
	//-------------------------------------------------------------------------//

	struct BSPFace;

	//-------------------------------------------------------------------------//

	struct DLL_API Plane
	{
		//////////////////////////////////////////////////////////////////////
		/// \brief Конструктор
		//////////////////////////////////////////////////////////////////////
		Plane();

		//////////////////////////////////////////////////////////////////////
		/// \brief Инициализировать плоскость
		///		
		/// \param[in] Face Плоскость браша
		/// \param[in] Textures Массив текстур
		//////////////////////////////////////////////////////////////////////
		void InitPlane( BSPFace& Face );

		int			StartIndex;		///< Начальный индекс в буфере индексов
		int			NumberIndices;	///< Количество индексов в плоскости

		GLuint		LightmapID;		///< Идентификатор карты освещения
	};

	//-------------------------------------------------------------------------//
}

#endif // PLANE_H