//////////////////////////////////////////////////////////////////////////
// 
//			*** lifeEngine (Двигатель Жизни) ***
//					Copyright (C) 2017
//
// Связь со мной:		https://vk.com/zombihello
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// 
//////////////////////////////////////////////////////////////////////////

#ifndef SCENE_H
#define SCENE_H

#define COMPILING_LIBRARY
#include <DllGlobal.h>

///////////////////////////
// СИСТЕМНЫЕ БИБЛИОТЕКИ
///////////////////////////
#include <vector>
#include <map>
using namespace std;

//////////////
// OPENGL
//////////////
#include <glew\glew.h>
#include <glm\glm.hpp>

//////////////////
// SFML
//////////////////
#include <SFML\Graphics.hpp>
#include <SFML\OpenGL.hpp>
using namespace sf;

////////////////
// LIFEENGINE
///////////////
#include <System\System.h>
#include <System\GBuffer.h>
#include <Graphics\PointLight.h>
namespace le
{
	//-------------------------------------------------------------------------//

	class Model;
	class BoundingBox;
	class Level;
	class Camera;
	class Frustum;
	class Skeleton;
	class PointLight;
	class LightManager;

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Класс для работы со сценой
	///
	/// Данный класс необходим для рендера графики на экран
	//////////////////////////////////////////////////////////////////////
	class DLL_API Scene
	{
	public:

		//-------------------------------------------------------------------------//

		//////////////////////////////////////////////////////////////////////
		/// \brief Структура хранения меша для сцены
		//////////////////////////////////////////////////////////////////////
		struct DLL_API InfoMesh
		{
			//////////////////////////////////////////////////////////////////////
			/// \brief Конструктор
			//////////////////////////////////////////////////////////////////////
			InfoMesh();

			int					CountIndexs; ///< Количество индексов вершин
			float				DistanceToCamera; ///< Растояние между объектом и камерой
			bool				IsRender; ///< Рендерить ли этот меш

			GLuint				VertexArray; ///< VAO
			Skeleton*			Skeleton; ///< Скелет меша
			BoundingBox*		BoundingBox; ///< Ограничивающее тело меша

			glm::vec3*			Position; ///< Позиция меша на сцене
			glm::mat4*			MatrixTransformation; ///< Матрица трансформации меша
		};

		//-------------------------------------------------------------------------//

		//////////////////////////////////////////////////////////////////////
		/// \brief Буффер рендера всей геометрии сцены 
		//////////////////////////////////////////////////////////////////////
		struct DLL_API RenderBuffer
		{
			vector<InfoMesh*>		AnimationModels; ///< Буффер рендера анимируемых моделей
			vector<InfoMesh*>		StaticModels; ///< Буффер рендера статичных моделей
			vector<InfoMesh*>		Level; ///< Буффер рендера уровня
		};

		//-------------------------------------------------------------------------//

		//////////////////////////////////////////////////////////////////////
		/// \brief Конструктор
		//////////////////////////////////////////////////////////////////////
		Scene( System& System );

		//////////////////////////////////////////////////////////////////////
		/// \brief Деструктор
		//////////////////////////////////////////////////////////////////////
		~Scene();

		//////////////////////////////////////////////////////////////////////
		/// \brief Добавить модель на сцену
		///		
		/// \param[in] Model Указатель на модель
		//////////////////////////////////////////////////////////////////////
		void AddModelToScene( Model* Model );

		//////////////////////////////////////////////////////////////////////
		/// \brief Удалить модель с сцены
		///		
		/// \param[in] Model Указатель на модель
		//////////////////////////////////////////////////////////////////////
		void RemoveModelFromScene( Model* Model );

		//////////////////////////////////////////////////////////////////////
		/// \brief Добавить уровень на сцену
		///		
		/// \param[in] Level Указатель на уровень
		//////////////////////////////////////////////////////////////////////
		void AddLevelToScene( Level* Level );

		//////////////////////////////////////////////////////////////////////
		/// \brief Удалить уровень с сцены
		///		
		/// \param[in] Level Указатель на уровень
		//////////////////////////////////////////////////////////////////////
		void RemoveLevelFromScene( Level* Level );

		//////////////////////////////////////////////////////////////////////
		/// \brief Добавить менеджер света на сцену
		///		
		/// \param[in] LightManager Указатель на менеджер света
		//////////////////////////////////////////////////////////////////////
		void AddLightManagerToScene( LightManager* LightManager );

		//////////////////////////////////////////////////////////////////////
		/// \brief Добавить точечный свет на сцену
		///		
		/// \param[in] PointLight Указатель на точечный свет
		//////////////////////////////////////////////////////////////////////
		void AddPointLightToScene( PointLight* PointLight );

		//////////////////////////////////////////////////////////////////////
		/// \brief Удалить точечный источник света со сцены
		///		
		/// \param[in] PointLight Указатель на источник света
		//////////////////////////////////////////////////////////////////////
		void RemovePointLightFromScene( PointLight* PointLight );

		//////////////////////////////////////////////////////////////////////
		/// \brief Удалить точечный источник света со сцены
		///		
		/// \param[in] NameLight Название источника света
		//////////////////////////////////////////////////////////////////////
		void RemovePointLightFromScene( const string& NameLight );

		//////////////////////////////////////////////////////////////////////
		/// \brief Удалить менеджер света со сцены
		///		
		/// \param[in] LightManager Указатель на менеджер света
		//////////////////////////////////////////////////////////////////////
		void RemoveLightManagerFromScene( LightManager* LightManager );

		//////////////////////////////////////////////////////////////////////
		/// \brief Убрать камеру со сцены
		//////////////////////////////////////////////////////////////////////
		void RemoveCamera();

		//////////////////////////////////////////////////////////////////////
		/// \brief Отрендерить сцену
		//////////////////////////////////////////////////////////////////////
		void RenderScene();

		//////////////////////////////////////////////////////////////////////
		/// \brief Очистить сцену
		//////////////////////////////////////////////////////////////////////
		void ClearScene();

		//////////////////////////////////////////////////////////////////////
		/// \brief Задать камеру
		///		
		/// \param[in] Camera Камера
		//////////////////////////////////////////////////////////////////////
		void SetCamera( Camera& Camera );

		//////////////////////////////////////////////////////////////////////
		/// \brief Получить G-Буффер сцены
		///		
		/// \return GBuffer&
		//////////////////////////////////////////////////////////////////////
		GBuffer& GetGBuffer();

	private:

		Shader								AnimationModelsRender; ///< Шейдер рендера анимируемых моделей
		Shader								StaticModelsRender; ///< Шейдер рендера статичных моделей
		Shader								LevelRender; ///< Шейдер рендера уровня
		Shader								QueryTestRender; ///< Шейдер тестового рендера на перекрытия
		Shader								PointLightRender; ///< Шейдер точечного света
		Shader								StencilTestRender; ///< Шейдер рендера в буффер трафарета

		glm::mat4*							ViewMatrix; ///< Матрица вида
		glm::mat4*							ProjectionMatrix; ///< Матрица проекции
		glm::mat4							PVMatrix; ///< Матрица Projection * View

		Frustum*							Frustum; ///< Пирамида усечения
		Camera*								Camera; ///< Камера
		Level*								LevelInScene; ///< Уровень который нах. на сцене
		LightManager*						LightManager; ///< Менеджер света который прикреплен к сцене
		GBuffer								GBuffer; ///< G-Буффер

		vector<Model*>						ModelsInScene; ///< Массив моделей которые нах. на сцене
		vector<PointLight*>					PointLights; ///< Массив точечный источников которые нах. на сцене
		vector<InfoMesh*>					GeometryBuffer_Level; ///< Буффер геометрии уровня (отсортированый по удалению от камеры)
		vector<InfoMesh*>					GeometryBuffer_Models; ///< Буффер геометрии моделей
		vector<PointLight*>					LightBuffer_PointLight; ///< Буффер точечного света который попал в камеру 
		map<GLuint, RenderBuffer>			RenderBuffer; ///< Буффер рендера всей геометрии сцены 
	};

	//-------------------------------------------------------------------------//
}

#endif // SCENE_H
