//////////////////////////////////////////////////////////////////////////
// 
//			*** lifeEngine (Двигатель Жизни) ***
//					Copyright (C) 2017
//
// Связь со мной:		https://vk.com/zombihello
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// 
//////////////////////////////////////////////////////////////////////////

#ifndef BSPINFO_H
#define BSPINFO_H

#define COMPILING_LIBRARY
#include <DllGlobal.h>

//////////////////
// LIFEENGINE
//////////////////
#include <Graphics\Level\Plane.h>
#include <System\System.h>

namespace le
{
	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Перечисление типов кусков BSP файла
	//////////////////////////////////////////////////////////////////////
	enum Lumps
	{
		Entities = 0,				///< Хранит позицию игрока, объекта и т.д
		Textures,					///< Хранит информацию про текстуры
		Planes,						///< Хранит плоскости
		Nodes,						///< Хранит BSP ветки
		Leafs,						///< Хранит листы узлов
		LeafFaces,					///< Хранит индексы листа в фейсах
		LeafBrushes,				///< Хранит индексы листа в брашах
		Models,						///< Хранит информацию о моделях
		Brushes,					///< Хранит информацию о брашах (для коллизии)
		BrushSides,					///< Хранит информацию о поверхностях браша
		Vertices,					///< Хранит вершины уровня
		Indices,					///< Хранит индексы уровня
		Shaders,					///< Хранит файлы шейдеров (смешивание, анимация ..)
		Faces,						///< Хранит фейся уровня
		Lightmaps,					///< Хранит световые карты для уровня
		LightVolumes,				///< Хранит дополнительную информацию о освещении света
		VisData,					///< Хранит PVS и информацию о кластере (видимость)
		MaxLumps					///< Константа для хранения количества кусков
	};

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Перечисление типов плоскостей
	//////////////////////////////////////////////////////////////////////
	enum TypePlane
	{
		PolygonFace = 1,		///< Полигон
		Patch,					///< Патч
		MeshFace,				///< Меш (модель)
		Billboard				///< Билборд
	};

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Структура заголовка BSP файла
	//////////////////////////////////////////////////////////////////////
	struct BSPHeader
	{
		char		StrID[ 4 ];		///< Это всегда должно быть 'LBSP'
		int			Version;		///< Версия формата (на данный момент версия - 0x10)
	};

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Структура одного куска BSP файла
	//////////////////////////////////////////////////////////////////////
	struct BSPLump
	{
		int			Offset;			///< Смещение в файле до начала этого куска
		int			Length;			///< Длина в байтах для этого куска	
	};

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Структура вершин BSP файла
	//////////////////////////////////////////////////////////////////////
	struct BSPVertex
	{
		glm::vec3		Position;			///< Позиция вершины
		glm::vec2		TextureCoord;		///< Текстурные координаты
		glm::vec2		LightmapCoord;		///< Координаты светокарты (lightmap)
		glm::vec3		Normal;				///< Нормаль вершины
		byte			Color[ 4 ];			///< RGBA цвет для вершин

		bool operator==( BSPVertex& Vertex );
	};

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Структура моделей в BSP файле
	//////////////////////////////////////////////////////////////////////
	struct BSPModel
	{
		glm::vec3		Min;					///< Ограничивающее тело (бокс) минимальная позиция
		glm::vec3		Max;					///< Ограничивающее тело (бокс) максимальная позиция
		int				StartFaceIndex;			///< Начальный индекс первого фейса
		int				NumOfFaces;				///< Количество фейсов
		int				StartBrushIndex;		///< Начальный индекс первого браша
		int				NumOfBrushes;			///< Количество брашей
	};

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Структура фейсов BSP файла
	//////////////////////////////////////////////////////////////////////
	struct BSPFace
	{
		int			TextureID;			///< Идентификатор текстуры
		int			Effect;				///< Индекс эффектов (-1 = n/a)
		TypePlane	Type;				///< Тип фейса (1 = полигон, 2 = патч, 3 = меш, 4 = билборд)
		int			StartVertIndex;		///< Начальный индекс первой вершины
		int			NumOfVerts;			///< Количество вершин
		int			StartIndex;			///< Начальный индекс в массиве индексов
		int			NumOfIndices;		///< Количество индексов в фейсе
		int			LightmapID;			///< Идентификатор карты освещения
		int			LMapCorner[ 2 ];	///< Угол света в изображении фейса
		int			LMapSize[ 2 ];		///< Размер секции световой карты
		glm::vec3	LMapPos;			///< Позиция световой карты.
		glm::vec3	LMapVecs[ 2 ];		///< 3D-пространство для S и T единичных векторов
		glm::vec3	Normal;				///< Нормаль фейса
		int			Size[ 2 ];			///< Габаритные размеры безье
	};

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Структура текстуры BSP файла
	//////////////////////////////////////////////////////////////////////
	struct BSPTexture
	{
		char	StrName[ 64 ];				///< Название текстуры без расширения
		int		Flags;						///< Поверхностные флаги
		int		Type;						///< Тип текстуры (твердый, вода и т.д) (type & 1) = 1 (твердый)
	};

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Структура карт освещения BSP файла
	//////////////////////////////////////////////////////////////////////
	struct BSPLightmap
	{
		byte	ImageBits[ 128 ][ 128 ][ 3 ];		///< Данные в формате RGB разрешения 128x128
	};

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Структура хранит ветки BSP дерева
	//////////////////////////////////////////////////////////////////////
	struct BSPNode
	{
		int				Plane;					///< Индекс в массиве плоскостей
		int				Front;					///< Дочерний индекс для передней ветки
		int				Back;					///< Дочерний индекс для задней ветки
		glm::ivec3		Min;					///< Ограничивающее тело (бокс) минимальная позиция
		glm::ivec3		Max;					///< Ограничивающее тело (бокс) максимальная позиция
	};

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Структура хранит листья (конечную ветку) в BSP дереве
	//////////////////////////////////////////////////////////////////////
	struct BSPLeaf
	{
		int				Cluster;			///< Видимый кластер
		int				Area;				///< Зона портала
		glm::ivec3		Min;				///< Ограничивающее тело (бокс) минимальная позиция
		glm::ivec3		Max;				///< Ограничивающее тело (бокс) максимальная позиция
		int				LeafFace;			///< Первый индекс в массиве фейсов
		int				NumOfLeafFaces;		///< Количество фейсов для этого листа
		int				LeafBrush;			///< Первый индекс в массиве брашей
		int				NumOfLeafBrushes;		///< Количество брашей для этого листа
	};

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Структура хранит разделяющую плоскость в BSP дереве
	//////////////////////////////////////////////////////////////////////
	struct BSPPlane
	{
		glm::vec3		Normal;			///< Нормаль плоскости
		float			Distance;		///< Плоское расстояние от источника
	};

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Структура хранит информацию кластеров для PVS'а
	//////////////////////////////////////////////////////////////////////
	struct DLL_API BSPVisData
	{
		//////////////////////////////////////////////////////////////////////
		/// \brief Конструктор
		//////////////////////////////////////////////////////////////////////
		BSPVisData();

		//////////////////////////////////////////////////////////////////////
		/// \brief Деструктор
		//////////////////////////////////////////////////////////////////////
		~BSPVisData();

		int			NumOfClusters;			///< Количество кластеров
		int			BytesPerCluster;		///< Количество байтов( 8 бит ) в бите кластера
		byte*		Bitsets;				///< Массив байтов, который содержит кластерные биты			
	};

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Структура хранит энтити-объекты на карте
	//////////////////////////////////////////////////////////////////////
	struct DLL_API BSPEntities
	{
		//////////////////////////////////////////////////////////////////////
		/// \brief Конструктор
		//////////////////////////////////////////////////////////////////////
		BSPEntities();

		//////////////////////////////////////////////////////////////////////
		/// \brief Деструктор
		//////////////////////////////////////////////////////////////////////
		~BSPEntities();

		char*		EntitiesData;			///< Массив данных содерж. информацию о энтити
	};

	//-------------------------------------------------------------------------//
	
	//////////////////////////////////////////////////////////////////////
	/// \brief Структура хранит данные о браше
	//////////////////////////////////////////////////////////////////////
	struct BSPBrush
	{
		int			BrushSide;			///< Стартовая сторона брашевая
		int			NumOfBrushSides;	///< Количество сторон у браша
		int			TextureID;			///< Индекс текстуры для браша
	};

	//-------------------------------------------------------------------------//
	
	//////////////////////////////////////////////////////////////////////
	/// \brief Структура хранит данные о стороне браша
	//////////////////////////////////////////////////////////////////////
	struct BSPBrushSide
	{
		int			Plane;				///< Индекс плоскости
		int			TextureID;			///< Индекс текстуры
	};

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Структура хранит информацию для рендера BSP полигонов
	//////////////////////////////////////////////////////////////////////
	struct InfoBSPPolygon
	{
		GLuint								Texture;			///< Текстура полигонов
		vector<Plane*> 					RenderPlanes;		///< Массив полигонов для рендера
	};

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Структура хранит информацию для рендера 
	/// BSP моделей (двери, лифты и т.д)
	//////////////////////////////////////////////////////////////////////
	struct InfoBSPModel
	{
		GLuint								Texture;			///< Текстура полигонов
		map<glm::mat4*, vector<Plane*> >	RenderPlanes;		///< Массив полигонов для рендера
	};

	//-------------------------------------------------------------------------//
}

#endif // BSPINFO_H