//////////////////////////////////////////////////////////////////////////
// 
//			*** lifeEngine (Двигатель Жизни) ***
//					Copyright (C) 2017
//
// Связь со мной:		https://vk.com/zombihello
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// 
//////////////////////////////////////////////////////////////////////////

#ifndef BASIC_APPLICATION_H
#define BASIC_APPLICATION_H

#define COMPILING_LIBRARY
#include <DllGlobal.h>

//////////////
// OGRE
//////////////
#include <Ogre.h>

namespace le
{
	//-------------------------------------------------------------------------//

	class System;

	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Базовый класс приложения
	///
	/// Данный класс необходим для работы приложения. Он содержит
	/// все необходимые объекты/методы которые нужны, например, для
	/// добовления на сцену какой-то модели
	///
	/// \warning Необходимо определить Update() (В этом методе проходит
	/// обновление приложения, например, загрузка карты, 
	/// движение персонажей и т.д)
	//////////////////////////////////////////////////////////////////////
	class DLL_API BasicApplication
	{
	public:
		//////////////////////////////////////////////////////////////////////
		/// Конструктор который подготавливает приложение к работе
		/// 
		/// \param[in] System Класс сисетмы движка
		//////////////////////////////////////////////////////////////////////
		BasicApplication( System& System );

		//////////////////////////////////////////////////////////////////////
		/// \brief Обновление приложения
		/// \details В этом методе должен быть ваш код игры
		//////////////////////////////////////////////////////////////////////
		virtual void Update() = 0;

	protected:

		Ogre::Root*						Root; ///< Главный класс который необходим для Ogre
		Ogre::RenderWindow*				Window; ///< Окно игры
		Ogre::SceneManager*				Scene; ///< Игровая сцена
	};

	//-------------------------------------------------------------------------//
}

#endif // BASIC_APPLICATION_H