//////////////////////////////////////////////////////////////////////////
// 
//			*** lifeEngine (Двигатель Жизни) ***
//					Copyright (C) 2017
//
// Связь со мной:		https://vk.com/zombihello
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// 
//////////////////////////////////////////////////////////////////////////

#ifndef LOGGER_H
#define LOGGER_H
#pragma warning( push )

#pragma warning( disable: 4251 )

#define COMPILING_LIBRARY
#include <DllGlobal.h>

/////////////////////
// СИСТЕМНЫЕ БИБЛИОТЕКИ
////////////////////
#include <iostream>
#include <fstream>
#include <sstream>
using namespace std;

namespace le
{
	//-------------------------------------------------------------------------//

	//////////////////////////////////////////////////////////////////////
	/// \brief Класс для ведения логов
	///
	/// Данный класс предназначен для ведения и записи логов в файл
	//////////////////////////////////////////////////////////////////////
	class DLL_API Logger
	{
	public:

		//-------------------------------------------------------------------------//

		enum Type
		{
			None,
			Info,
			Warning,
			Error
		};

		//-------------------------------------------------------------------------//

		//////////////////////////////////////////////////////////////////////
		/// \brief Написать лог
		///		
		/// \param[in] TypeLog Тип лога (ошибка, предупреждение и т.д)
		/// \param[in] Message Текст сообщения
		//////////////////////////////////////////////////////////////////////
		static void Log( const Type& TypeLog, const string& Message );

		//////////////////////////////////////////////////////////////////////
		/// \brief Указать файл для логов
		///		
		/// \param[in] Route Путь к файлу
		//////////////////////////////////////////////////////////////////////
		static void SetLogFile( const string& Route );

	private:

		static ofstream			FileSave; ///< Файл в который записываються логи
	};

	//-------------------------------------------------------------------------//
}

#pragma warning( pop )
#endif // LOGGER_H

