#ifndef GBUFFER_H
#define GBUFFER_H

#define COMPILING_LIBRARY
#define GBUFFER_NUM_TEXTURES 3
#include "../../DllGlobal.h"

////////////////
/// LIFEENGINE
///////////////
#include "../System.h"

namespace le
{
	//-------------------------------------------------------------------------//

	class DLL_API GBuffer
	{
	public:

		//-------------------------------------------------------------------------//

		enum GBuffer_Texture_Type
		{
			Position,
			Textures,
			Normal		
		};

		//-------------------------------------------------------------------------//

		////////////////////////////////////
		/// КОНСТРУКТОР
		///////////////////////////////////
		GBuffer();

		////////////////////////////////////
		/// ДЕСТРУКТОР
		///////////////////////////////////
		~GBuffer();

		////////////////////////////////////
		/// ИНИЦИАЛИЗИРОВАТЬ G-БУФФЕР
		///////////////////////////////////
		bool InitGBuffer( float WindowWidth, float WindowHeight );

		////////////////////////////////////
		/// ОЧИСТИТЬ ФИНАЛЬНЫЙ КАДР
		///////////////////////////////////
		void ClearFrame();

		////////////////////////////////////
		/// ОТРЕНДЕРИТЬ ФИНАЛЬНЫЙ КАДР
		///////////////////////////////////
		void RenderFrame( Vector2u WindowSize );

		//////////////////////////////////////////
		/// ПРИВЯЗАТЬ FBO ДЛЯ РЕНДЕРА В БУФЕРЫ
		//////////////////////////////////////////
		void BindForRenderBuffers();

		//////////////////////////////////////////
		/// ПРИВЯЗАТЬ FBO ДЛЯ ТЕСТА ТРАФАРЕТА
		//////////////////////////////////////////
		void BindForStencilTest();

		//////////////////////////////////////////
		/// ПРИВЯЗАТЬ FBO ДЛЯ РЕНДЕРА СВЕТА
		//////////////////////////////////////////
		void BindForRenderLight();

private:

		bool				IsGBufferInit;

		GLuint				FrameBuffer;	
		GLuint				FinalFrame;
		GLuint				DepthBuffer;

		GLuint				Buffers[ GBUFFER_NUM_TEXTURES ];
	};

	//-------------------------------------------------------------------------//
}

#endif // GBUFFER_H