#ifndef SKELETON_H
#define SKELETON_H

#define COMPILING_LIBRARY
#include "../../DllGlobal.h"

////////////////
/// LIFEENGINE
///////////////
#include "../System.h"
#include <Matrix.h>

namespace le
{
	//-------------------------------------------------------------------------//

	struct DLL_API Bone
	{
		Bone*				Perent;
		vector<Bone>		vChild;

		Matrixf				StartMatrix;
		Matrixf				InvertMatrix;
	};

	//-------------------------------------------------------------------------//

	class DLL_API Skeleton
	{
	public:
		/////////////////
		/// йнмярпсйрнп
		/////////////////
		Skeleton();

		/////////////////
		/// деярпсйрнп
		/////////////////
		~Skeleton();

		//////////////////////////////
		/// днаюбхрэ йнярэ яйекерс
		//////////////////////////////
		void AddBone( Bone bone );

		///////////////////////////////////////////////////
		/// гюдюрэ рпюмятнплюжхч лндекх оепед ахмдхмцнл 
		///////////////////////////////////////////////////
		void SetBindShape( Matrixf bindShape );

		///////////////////////////////////////////////////
		/// онксвхрэ рпюмятнплюжхч лндекх оепед ахмдхмцнл 
		///////////////////////////////////////////////////
		float* GetBindShape();

		/////////////////////////////////
		/// онксвхрэ бяе йнярх яйекерю
		////////////////////////////////
		vector<Bone> GetAllBones();

		// TODO: ЯНГДЮМЮ ДКЪ РЕЯРЮ ЯЙЕКЕРЮ, ОНГФЕ АСДЕР ДКЪ debug'Ю
		void DrawSkeleton();
	private:
		Matrixf				BindShape;
		vector<Bone>		vBone;
	};

	//-------------------------------------------------------------------------//
}

#endif // SKELETON_H
